app/views/spots/inspot.html.erb

  <tr>
    <th><% @spotname = (Spot.find_by_spot_id(@account_spot[0])) %></th>
---
SELECT "spots".* FROM "spots" WHERE "spots"."spot_id" = '56644f30-05a6-11e1-ba60-020000881993' LIMIT 1

<% @account_spot.each do |spot|
@account = Account.find_by_account_id (spot.account_id )
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = '01a3af40-05a6-11e1-ba60-020000881993' LIMIT 1