app/views/spots/joined.html.erb

SELECT `spots`.* FROM `spots` WHERE `spots`.`spot_id` = '23c960d0-04b4-11e1-8f63-020000881993' LIMIT 1
---
  <tr>
    <td><%= (Spot.find_by_spot_id (spot.spot_id)).local %></td>