app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT `accounts`.* FROM `accounts`

  def show
    @account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = ? LIMIT 1  [["account_id", "01a3af40-05a6-11e1-ba60-020000881993"]]

  def edit
    @account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = ? LIMIT 1  [["account_id", "01a3af40-05a6-11e1-ba60-020000881993"]]

  def create
    # Account.new não guarda os dados na base de dados.
    # Account.create guarda os dados na base de dados.
    @account = Account.new(params[:account])
    @account.account_id = UUIDTools::UUID.timestamp_create().to_s
    @account.username = @account.email.split('@')[0]
    @account.account_level = 1
    @account.account_state = 0
    @account.sex = nil
    @account.birthdate = nil
    @account.login_count = 0
    @account.unban_time = nil
    @account.expiration_time = nil
    @account.last_login = nil
    @account.last_ip = request.remote_ip
    respond_to do |format|
      if @account.save
        @profile = Profile.new
        @profile.account_id = @account.account_id
        @profile.first_name = ""
        @profile.last_name = ""
        @profile.save
---
INSERT INTO `accounts` (`account_id`, `account_level`, `account_state`, `birthdate`, `created_at`, `email`, `expiration_time`, `last_ip`, `last_login`, `login_count`, `password`, `sex`, `unban_time`, `updated_at`, `username`) VALUES ('4e539350-015a-11e1-ae2e-020000881993', 1, 0, '1989-02-25', '2011-10-28 11:45:17', 'ei11001@fe.up.pt', NULL, '127.0.0.1', NULL, 0, '827ccb0eea8a706c4c34a16891f84e7b', 0, NULL, '2011-10-28 11:45:17', 'ei11001')
INSERT INTO `profiles` (`account_id`, `created_at`, `first_name`, `last_name`, `updated_at`) VALUES ('d14d81d0-0173-11e1-a690-020000881993', '2011-10-28 14:47:54', '', '', '2011-10-28 14:47:54')

  def update
    @account = Account.find(params[:id])
    respond_to do |format|
      if @account.update_attributes(params[:account])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = ? LIMIT 1  [["account_id", "31aef9d0-06df-11e1-9ff3-020000881993"]]
UPDATE "accounts" SET "spot_id" = '68757ca0-0725-11e1-af84-020000881993', "password" = '907fc10f1338514846ef98a4e284c8e8', "updated_at" = '2011-11-04 22:27:20.155000' WHERE "accounts"."account_id" = '31aef9d0-06df-11e1-9ff3-020000881993'

  def destroy
    @account = Account.find(params[:id])
    @account.destroy
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`account_id` = 'd14d81d0-0173-11e1-a690-020000881993' LIMIT 1
DELETE FROM `accounts` WHERE `accounts`.`account_id` = 'd14d81d0-0173-11e1-a690-020000881993'

  def email
    @account = Account.find_by_email(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."email" IS NULL LIMIT 1

  def join
    @account = Account.find(params[:id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = ? LIMIT 1  [["account_id", "31aef9d0-06df-11e1-9ff3-020000881993"]]