app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT `profiles`.* FROM `profiles`

  def update
    @profile = Profile.find(params[:id])
    respond_to do |format|
      if @profile.update_attributes(params[:profile])
---
UPDATE "profiles" SET "first_name" = 'Rúben', "last_name" = 'Veloso', "updated_at" = '2011-11-02 22:59:13.805000' WHERE "profiles"."account_id" = '01a3af40-05a6-11e1-ba60-020000881993'