app/controllers/spots_controller.rb

  def index
    @spots = Spot.all
---
SELECT `spots`.* FROM `spots`

  def show
    @spot = Spot.find(params[:id])
---
SELECT "spots".* FROM "spots" WHERE "spots"."spot_id" = ? LIMIT 1  [["spot_id", "5652ea10-05a6-11e1-ba60-020000881993"]]

  def edit
    @spot = Spot.find(params[:id])
---
SELECT "spots".* FROM "spots" WHERE "spots"."spot_id" = ? LIMIT 1  [["spot_id", "8eafc6a0-06e4-11e1-9ff3-020000881993"]]

  def create
    @spot = Spot.new(params[:spot])
    @spot.spot_id = UUIDTools::UUID.timestamp_create().to_s
    respond_to do |format|
      if @spot.save
---
INSERT INTO `spots` (`created_at`, `end_time`, `local`, `owner_id`, `spot_id`, `start_time`, `updated_at`) VALUES ('2011-11-01 13:46:49', '2011-11-01 18:00:00', 'B208', NULL, 'f2c69300-048f-11e1-bec9-020000881993', '2011-11-01 14:00:00', '2011-11-01 13:46:49')

  def update
    @spot = Spot.find(params[:id])
---
SELECT `spots`.* FROM `spots` WHERE `spots`.`spot_id` = '7460a560-0493-11e1-973e-020000881993' LIMIT 1

  def owner
    @spots = Spot.find_all_by_owner_id (params[:id])
---
SELECT `spots`.* FROM `spots` WHERE `spots`.`owner_id` = '131b4ce0-0495-11e1-973e-020000881993'

  def inspot
    @account_spot = AccountSpot.find_all_by_spot_id (params[:id])
    @accountslist = []
    @account_spot.each do |spot|
      @account = Account.find_by_account_id (spot.account_id )
---
SELECT "spots".* FROM "spots" WHERE "spots"."spot_id" = '56644f30-05a6-11e1-ba60-020000881993' LIMIT 1
SELECT "accounts".* FROM "accounts" WHERE "accounts"."account_id" = '01a3af40-05a6-11e1-ba60-020000881993' LIMIT 1