app/views/accounts/show.html.erb

SELECT "spots".* FROM "spots" WHERE "spots"."spot_id" = '0cabab00-06e5-11e1-9ff3-020000881993' LIMIT 1
---
  <% if @account.spot_id != nil
    @nome = (Spot.find_by_spot_id (@account.spot_id)).local end %>